# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [2]:
# Your code here
import pandas as pd
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
df = pd.read_csv(url)

In [3]:
# 1.1. Columns in lower case
# 1.2. White spaces in column names should be replaced by `_`*
df.columns = list(map(lambda x : x.lower().replace(" ","_"), df.columns)) #use this to clean columns names
print(df.columns)

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [4]:
#1.3. `st` could be replaced for `state`
#we can apply a list of names (we retrieve the former list and change the names we want to change)
df.columns = ['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount']
print(df.columns)

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [5]:
# Your code here
# 2.1. - *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", 
# which need to be standardized, for example, to "M" and "F".*
print(df["gender"].value_counts())
gender_assignment = {"Male":"M","female":"F","Femal":"F","M":"M","F":"F"} #we need to include in the dictionary the key that we want to keep
df["gender"] = df["gender"].map(gender_assignment)
print(df["gender"].value_counts())

F         457
M         413
Male       39
female     28
Femal      17
Name: gender, dtype: int64
F    502
M    452
Name: gender, dtype: int64

In [6]:
# 2.2. - *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
print(df["state"].value_counts())
state_assignment = {"Cali":"California","WA":"Washington","AZ":"Arizona","Oregon":"Oregon","California":"California","Arizona":"Arizona","Nevada":"Nevada","Washington":"Washington"}
df["state"] = df["state"].map(state_assignment)
print(df["state"].value_counts())

Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: state, dtype: int64
California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: state, dtype: int64

In [7]:
# 2.3. - *In education, "Bachelors" could be replaced by "Bachelor"*
print(df["education"].value_counts())
df["education"] = df["education"].replace("Bachelors","Bachelor")
print(df["education"].value_counts())

Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: education, dtype: int64
Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: education, dtype: int64

In [8]:
# 2.4. - *In Customer Lifetime Value, delete the `%` character*
print(df["customer_lifetime_value"].value_counts())
df["customer_lifetime_value"] = df["customer_lifetime_value"].str.replace("%","")
print(df["customer_lifetime_value"].value_counts())

445811.34%     4
251459.20%     4
272535.64%     3
578018.22%     3
684615.03%     3
              ..
245357.08%     1
507566.27%     1
321497.94%     1
1227534.31%    1
899704.02%     1
Name: customer_lifetime_value, Length: 1027, dtype: int64
445811.34     4
251459.20     4
272535.64     3
578018.22     3
684615.03     3
             ..
245357.08     1
507566.27     1
321497.94     1
1227534.31    1
899704.02     1
Name: customer_lifetime_value, Length: 1027, dtype: int64

In [9]:
# 2.5. - *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*
class_assignment = {"Sports Car":"Luxury","Luxury SUV":"Luxury","Luxury Car":"Luxury"} #here we need to use a tuple and not a list because dictionary keys are immutable
df["vehicle_class"] = df["vehicle_class"].replace("Sports Car","Luxury").replace("Luxury SUV","Luxury").replace("Luxury Car","Luxury")
print(df["vehicle_class"].value_counts())

#here using class_assignment and map did not work

Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: vehicle_class, dtype: int64

In [10]:
class_assignment = ["Sports Car","Luxury SUV","Luxury Car"]
df["vehicle_class"] = df["vehicle_class"].apply(lambda x: "Luxury" if x in class_assignment else x)

In [11]:
print(df["vehicle_class"].value_counts())

Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: vehicle_class, dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [12]:
# # Your code here
# 3.1. - *Customer lifetime value should be numeric*
print(df.dtypes)
df["customer_lifetime_value"] = pd.to_numeric(df["customer_lifetime_value"],errors='coerce') #this function allows to change the type of the column without dealing with the Nan
print("")
print(df["customer_lifetime_value"].isna().sum())

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

2940

In [13]:

# 3.2. - *Number of open complaints has an incorrect format. Look at the different values it takes with 
# `unique()` and take the middle value. 
#As an example, 1/5/00 should be 5. 
#Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. 
#Finally, since it should be numeric, cast the column to be in its proper type.*

print(df["number_of_open_complaints"].unique())
print(df["number_of_open_complaints"].value_counts())

df["number_of_open_complaints"] = df["number_of_open_complaints"].str.split("/").str[1] #the split function will create 3 values, with str[1] we keep the value at index 1 (element in the middle)

#the column is already an int

['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan]
1/0/00    830
1/1/00    138
1/2/00     50
1/3/00     34
1/4/00     13
1/5/00      6
Name: number_of_open_complaints, dtype: int64

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [14]:
# Your code here
def find_null(dataframe, columns):
    missing_values = {}
    df_rows = len(dataframe)
    for column in columns:
        total_column_values = dataframe[column].value_counts().sum()
        missing_values[column] = df_rows - total_column_values
        print(f"The column {column} has {missing_values[column]} missing values.")

In [15]:
find_null(df,df.columns)

The column customer has 2937 missing values.
The column state has 2937 missing values.
The column gender has 3054 missing values.
The column education has 2937 missing values.
The column customer_lifetime_value has 2940 missing values.
The column income has 2937 missing values.
The column monthly_premium_auto has 2937 missing values.
The column number_of_open_complaints has 2937 missing values.
The column policy_type has 2937 missing values.
The column vehicle_class has 2937 missing values.
The column total_claim_amount has 2937 missing values.

In [16]:
df.isna().sum().to_dict() #this generates a dictionary with column names as keys and the sum of missing values as value

{'customer': 2937,
 'state': 2937,
 'gender': 3054,
 'education': 2937,
 'customer_lifetime_value': 2940,
 'income': 2937,
 'monthly_premium_auto': 2937,
 'number_of_open_complaints': 2937,
 'policy_type': 2937,
 'vehicle_class': 2937,
 'total_claim_amount': 2937}

In [17]:
# 4.1. - Drop the rows or columns with null values
#using how=any erases everything how=all drops 2937 rows
#use threshold
df_dropped = df.dropna(how="all")
df_dropped

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,M,Master,305955.03,38644.0,78.0,1,Personal Auto,Four-Door Car,361.455219
1067,VJ51327,California,F,High School or Below,2031499.76,63209.0,102.0,2,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.47,16061.0,88.0,0,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.11,79487.0,114.0,0,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.02,54230.0,112.0,0,Personal Auto,Two-Door Car,537.600000

In [18]:
df_threshold = df.dropna(thresh=10) #Rows with at least 10 non-null values are retained, and rows with fewer than 10 non-null values are dropped.
df_threshold

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,Bachelor,825629.78,62902.0,69.0,0,Personal Auto,Two-Door Car,159.383042
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,M,Master,305955.03,38644.0,78.0,1,Personal Auto,Four-Door Car,361.455219
1067,VJ51327,California,F,High School or Below,2031499.76,63209.0,102.0,2,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.47,16061.0,88.0,0,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.11,79487.0,114.0,0,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.02,54230.0,112.0,0,Personal Auto,Two-Door Car,537.600000

In [19]:
#4.2. Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
#We will first drop the missing values for state and gender columns
df2 = df.dropna(subset=['state'])
df2 = df2.dropna(subset=['gender'])
print(df2["state"].value_counts())
print("")
print(df2["gender"].value_counts())
print("")
#For education, we will fill null values with the mode by state and gender
#we use the groupby method
df2["education"] = df2["education"].fillna(df2.groupby(["state","gender"])["education"].transform(lambda x: x.mode().iloc[0])) #mode() returns a pd Series with modes, while iloc[0] selects the first element of the series

California    293
Oregon        276
Arizona       188
Washington    108
Nevada         89
Name: state, dtype: int64

F    502
M    452
Name: gender, dtype: int64

In [20]:
#try to apply this to several columns at once
#define a list of columns to change
categorical_columns = ['policy_type','vehicle_class']
for column in categorical_columns:
    df2[column] = df2[column].fillna(df2.groupby(["state","gender"])[column].transform(lambda x: x.mode().iloc[0]))
    print(df2[column].value_counts())
    print("")

Personal Auto     691
Corporate Auto    211
Special Auto       52
Name: policy_type, dtype: int64

Four-Door Car    508
Two-Door Car     184
SUV              179
Luxury            83
Name: vehicle_class, dtype: int64

In [21]:
df2.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [22]:
#for numerical columns
numerical_columns = ["customer_lifetime_value","income","monthly_premium_auto","total_claim_amount"]
for column in numerical_columns:
    df2[column] = df2[column].fillna(df2.groupby(["state","gender"])[column].transform('mean'))
    print(f"The column {column} has {df2[column].isna().sum()} missing values.")
    print("")

The column customer_lifetime_value has 0 missing values.

The column income has 0 missing values.

The column monthly_premium_auto has 0 missing values.

The column total_claim_amount has 0 missing values.

In [23]:
# 4.3. - Fill the null values with the previous or next value in the column
#for categorical: 
categorical_columns = ['state','gender','education','policy_type','vehicle_class']
numerical_columns = ["customer_lifetime_value","income","monthly_premium_auto","total_claim_amount"]
df3 = df
#for categorical values ffill
for column in categorical_columns:
    df3[column] = df3[column].fillna(method='ffill')
    print(f"The column {column} has {df3[column].isna().sum()} null values.")

#we see that column gender still has a missing value because the first valye is a NaN

print(df3.head(1))

The column state has 0 null values.
The column gender has 1 null values.
The column education has 0 null values.
The column policy_type has 0 null values.
The column vehicle_class has 0 null values.
  customer       state gender education  customer_lifetime_value  income  \
0  RB50392  Washington    NaN    Master                      NaN     0.0

   monthly_premium_auto number_of_open_complaints    policy_type  \
0                1000.0                         0  Personal Auto

   vehicle_class  total_claim_amount
0  Four-Door Car            2.704934

In [24]:
#for numerical values bfill
for column2 in numerical_columns:
    df3[column2] = df3[column2].fillna(method='bfill')
    print(f"The column {column2} has {df3[column2].isna().sum()} null values.")

df3.head()

# if there are consecutive missing values at the end of the column and there is no non-null value to copy backward, 
#the missing values will remain:

The column customer_lifetime_value has 2937 null values.
The column income has 2937 null values.
The column monthly_premium_auto has 2937 null values.
The column total_claim_amount has 2937 null values.

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,697953.59,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323

In [25]:
# 4.4. - Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)
#the grouping used above

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [26]:
# Your code here
df.duplicated()
df.duplicated().sum()

2936

In [27]:
#5.1. - Dropping all duplicate rows
import pandas as pd
df_copy1 = df.copy()
df_copy1.drop_duplicates(inplace=True)

In [28]:
# 5.2. - Keeping only the first occurrence of each duplicated row

# Assume df is your DataFrame
df_copy2 = df.copy()  # Create a copy of the original DataFrame

# Drop duplicated rows keeping only the first occurrence
df_copy2.drop_duplicates(inplace=True, keep='first')

In [29]:
#5.3. - Keeping only the last occurrence of each duplicated row

df_copy3 = df.copy()  # Create a copy of the original DataFrame

df_copy3.drop_duplicates(inplace=True, keep='last')

In [30]:
# 5.4. - Dropping duplicates based on a subset of columns
df_copy4 = df.copy()
subset_cols = ['education', 'income']
df_copy4.drop_duplicates(subset=subset_cols, inplace=True)

In [31]:
# 5.5. Dropping duplicates based on a specific column

df_copy5 = df.copy()
subset_col = 'income'
df_copy5.drop_duplicates(subset=[subset_col], inplace=True)

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [39]:
# Your code here

##Creating a function for three of the cleanings done above
def data_cleaner(df):
    gender_assignment = {"Male":"M","female":"F","Femal":"F","M":"M","F":"F"} 
    df.columns = list(map(lambda x : x.lower().replace(" ","_"), df.columns)) #use this to clean columns names
    df["gender"] = df["gender"].map(gender_assignment)  #cleaning gender
    df_cleaned = df.dropna(thresh=10) #Rows with at least 10 non-null values are retained, and rows with fewer than 10 non-null values are dropped.
    return df_cleaned

In [40]:
data_cleaner(df)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,697953.59,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,M,Master,305955.03,38644.0,78.0,1,Personal Auto,Four-Door Car,361.455219
1067,VJ51327,California,F,High School or Below,2031499.76,63209.0,102.0,2,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.47,16061.0,88.0,0,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.11,79487.0,114.0,0,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.02,54230.0,112.0,0,Personal Auto,Two-Door Car,537.600000

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [35]:
# Your code here
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,697953.59,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323

In [37]:
claim_amount_75 = df['total_claim_amount'].quantile(0.75)
lifetime_value_25 = df['customer_lifetime_value'].quantile(0.25)

high_claim = df[df['total_claim_amount']>claim_amount_75]
low_value = df[df['customer_lifetime_value']<lifetime_value_25]

target_customers = pd.concat([high_claim,low_value],axis=0,join='inner')

target_customers.describe()

,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount
count,5.320000e+02,532.000000,532.000000,532.000000
mean,5.981719e+05,30679.439850,144.443609,555.663094
std,5.464935e+05,29389.462187,588.108166,345.036007
min,2.004351e+05,0.000000,61.000000,1.838367
25%,2.717030e+05,0.000000,70.000000,321.600000
50%,3.796940e+05,26178.500000,92.000000,556.800000
75%,7.762479e+05,51888.750000,114.000000,710.408444
max,3.844586e+06,99316.000000,10202.000000,2893.239678